[
    {
      "roundApplicable": 1,
      "content": "STS - StellarTech Solutions: Receives mixed reactions for its innovative satellite constellation plans, sparking debates about the potential risks and benefits of increased global connectivity.",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "Is this a setback or part of a grander plan? ",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "OTS - OrionTech Solutions: CEO's disappearance triggers speculation about the company's future and stability, leaving investors uncertain about the implications",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "Is this a setback or part of a grander plan? ",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "SFI - StarForge Industries: Endeavors to overcome challenges posed by solar flare disruptions to resume normal manufacturing operations, prompting discussions about the resilience of their technology",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "loremfjkdjfkdjfkdjkfd",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "LL - LunaLogistics: Secures a major government contract for lunar cargo transport, generating both praise for their pivotal role in supporting lunar colonies' logistics needs and concerns about their growing influence in the space industry.",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "fjidjfkjdkjfkd",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "ABV - AstroBio Ventures: IPO announcement creates buzz, with investors anticipating the next frontier in biotech for space while questioning the potential risks and ethical considerations involved.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "loremmff",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "LL - LunaLogistics: Collaboration with AstroBio Ventures for lunar base construction sparks speculation about their long-term strategy and diversification efforts.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "loremmff",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "SFI - StarForge Industries: Ambitious plans for an orbital manufacturing center raise questions about the feasibility and sustainability of their expansion, fueling debates about the future of space manufacturing.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "lorejorej",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "STS - StellarTech Solutions: Launches a groundbreaking initiative to deploy small satellites for monitoring space debris, drawing attention to their commitment to space sustainability amidst concerns about the potential for satellite clutter.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "True potential or premature excitement? ",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "OTS - OrionTech Solutions: Investors react positively as the CEO returns from an unexpected absence, bringing renewed optimism and stability to the company. Additionally, hints of a significant breakthrough in propulsion technology spark excitement about future innovations in interplanetary travel.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "kjkjdkjkkd",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "OTS OrionTech's quantum network project faces a patent dispute, threatening to delay its ambitious plans.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "STS - StellarTech Solutions: Advanced space station design garners investor interest, prompting discussions about the company's continued innovation and its potential impact on space infrastructure.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "ABV - AstroBio Ventures: Breakthrough in synthetic food production faces regulatory hurdles, challenging their progress in sustainable living solutions and prompting questions about the safety and ethics of their technology.      ",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "SFI - StarForge Industries: Announces a breakthrough in space mining technology, triggering debates about the environmental and economic implications of asteroid mining.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "LL - LunaLogistics: Receives praise for their successful implementation of innovative lunar cargo transport methods, but concerns linger about the long-term sustainability and safety of their operations.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "CCV - CosmicCargo Ventures: IPO announcement generates excitement, highlighting the company's strong position in interstellar freight services, but raising concerns about the potential for market saturation and competition.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "LL - LunaLogistics: Legal dispute over lunar operations casts a shadow on their reputation, sparking public debate about the company's integrity and legal compliance.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "SFI - StarForge Industries: Struggling with space manufacturing disruptions caused by a solar flare, seeks solutions to mitigate impacts, prompting discussions about the resilience of their technology and contingency plans.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "OTS - OrionTech Solutions: Unveils plans for a joint venture with a space agency to establish a permanent lunar outpost, sparking optimism about the future of space exploration while fueling debates about the allocation of resources and priorities in space missions.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "STS - StellarTech Solutions: Receives acclaim for their contribution to satellite-based environmental monitoring, but concerns arise about the potential for data misuse and privacy violations.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "ABV - AstroBio Ventures: Achieves regulatory milestones in enhancing space habitat ecosystems, fostering sustainable living solutions, although concerns linger over operational scalability and biosafety protocols.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "OTS - OrionTech Solutions: Unveils prototype for interstellar spacecraft, sparking investor enthusiasm and anticipation, but raising questions about the feasibility and safety of interstellar travel.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "CCV - CosmicCargo Ventures: Government contract solidifies their position, instilling confidence in their logistical capabilities, but prompting discussions about the implications of government involvement in private space enterprises.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "ABV - AstroBio Ventures: Coping with a bio-dome leak incident on a space station, facing scrutiny over safety protocols, raising concerns about the reliability and preparedness of their technology.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "STS - StellarTech Solutions: Receives accolades for their contribution to satellite-based environmental monitoring, aiding in climate change research and disaster management efforts, but prompting debates about the potential for data monopolization and unequal access to information.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "SFI - StarForge Industries: Collaborates with a space agency to develop 3D-printed habitats for future Mars missions, showcasing their expertise in space construction, but raising questions about the ethics and sustainability of colonization efforts.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "LunaLogistics: Introduces an advanced lunar cargo transport vehicle, featuring enhanced safety measures and increased payload capacity, further solidifying their position as a leader in lunar logistics, but prompting concerns about the militarization of space and the potential for misuse of lunar resources.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "STS - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "ABV - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "SFI - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "CCV - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "OTS - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "LL - Breaking News: With Earth facing an imminent cosmic threat from an incoming asteroid, urgent efforts are underway to evacuate the population to safe havens. Lunar colonies emerge as primary destinations for refuge, prompting a surge in demand for transport services, leading to the suspension of non-essential cargo shipments and resource deliveries.",
      "forInsider": false
    },
    {
      "roundApplicable": 6,
      "content": "lorem",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "Insider chatter suggests that the recent uncertainties surrounding the disappearance of the CEO may soon be resolved, potentially boosting investor confidence in the company's stability and future prospects.",
      "forInsider": true
    },
    {
      "roundApplicable": 2,
      "content": "Insider information indicates that StarForge Industries is actively addressing concerns regarding the feasibility of their ambitious plans for an orbital manufacturing center, hinting at significant progress that could positively impact investor sentiment.",
      "forInsider": true
    },
    {
      "roundApplicable": 3,
      "content": "Rumors from insiders suggest that AstroBio Ventures is making significant strides in addressing regulatory hurdles and safety concerns related to their breakthrough in synthetic food production, potentially alleviating doubts about the safety and reliability of their technology.",
      "forInsider": true
    },
    {
      "roundApplicable": 4,
      "content": "Insider sources hint at StellarTech Solutions taking decisive actions to address concerns raised about the potential for data misuse and privacy violations, signaling a proactive approach that could restore investor trust in the company's ethical practices.",
      "forInsider": true
    },    
    {
      "roundApplicable": 5,
      "content": "Insider whispers indicate that CosmicCargo Ventures is actively engaging with government entities to navigate regulatory frameworks and ensure compliance, assuaging concerns about the implications of government involvement in their operations and bolstering investor confidence in the company's strategic direction.",
      "forInsider": true
    }    
    
  ]