[
    {
      "roundApplicable": 1,
      "content": "OTS - OrionTech's CEO  goes missing under mysterious circumstances during a test flight, fueling rumors of a secret space mission.",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "Is this a setback or part of a grander plan? ",
      "forInsider": false
    },
    {
      "roundApplicable": 1,
      "content": "LL LunaLogistics' Prototype lunar cargo ship vanishes; whispers of advanced stealth technology spread.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "OTS - Confidential documents of OrionTech leaked; hints at OrionTech's secret project: a quantum communication network that could change the tech landscape.      ",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "A groundbreaking innovation or a security failure?",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "LL LunaLogistics announces a joint venture with a newly established company AstroBio Ventures for a new lunar base, marking a potential strategic pivot",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "A bold move or a risky gamble",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "ABV AstroBio Ventures, a new player in biotech, makes its IPO with promising technology for sustainable life in space.",
      "forInsider": false
    },
    {
      "roundApplicable": 2,
      "content": "A visionary leap or an untested venture?",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "OTS Rumors swirl around OrionTech about a new energy source discovery, potentially disrupting the energy industry.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "A revolutionary breakthrough or clever market manipulation?",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "LL LunaLogistics' lunar base nears a significant ore discovery, sparking investor interest.",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "True potential or premature excitement? ",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "ABV AstroBio Ventures achieves a breakthrough in synthetic food production, but regulatory challenges loom",
      "forInsider": false
    },
    {
      "roundApplicable": 3,
      "content": "A leap in space sustainability or a regulatory nightmare?",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "OTS OrionTech's quantum network project faces a patent dispute, threatening to delay its ambitious plans.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "A solvable issue or a significant roadblock?",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "LL Environmental lawsuit filed against LunaLogistics over their lunar operations, dividing public opinion.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "An ethical dilemma or a manageable risk?",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "ABV - Merger talks with a major agricultural conglomerate, but details are scarce.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "A strategic alliance or a murky deal?",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "SFI - StarForge Industries makes its IPO, promising revolutionary materials manufactured in space.",
      "forInsider": false
    },
    {
      "roundApplicable": 4,
      "content": "Innovative genius or overly ambitious?",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "OTS - OrionTech unveils a prototype for an interstellar spacecraft, causing a stir among investors.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "A visionary project or an impractical dream?",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "LL - Plans to double LunaLogistics' fleet announced, raising questions about funding and operational feasibility.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "Expansion or overextension?",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "ABV  Bio-dome leak incident on a space station raises safety and reliability concerns for AstroBio.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "A setback or a surmountable challenge?",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "SFI StarForge Industries faces a challenge as a solar flare disrupts its space manufacturing processes, causing delays and uncertainty.",
      "forInsider": false
    },
    {
      "roundApplicable": 5,
      "content": "A temporary setback or a significant blow to their operations?",
      "forInsider": false
    }
  ]